OpenDTEF-v2012/tutorials/heatTransfer/overBuoyantPimpleDyMFoam/movingBox/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 0.1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    inlet
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    outlet
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    hole
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    frontAndBack
    {
        type            empty;
    }
    frontAndBack1
    {
        type            empty;
    }
}


// ************************************************************************* //
